{
  "add_cross_attention": false,
  "architectures": [
    "CamembertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 5,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 6,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Automatisation",
    "1": "Big Data",
    "2": "Computer Vision",
    "3": "Data Engineering",
    "4": "Data Science",
    "5": "Deep Learning",
    "6": "Gestion de projet IA",
    "7": "IA G\u00e9n\u00e9rative",
    "8": "LangChain / Agents RAG",
    "9": "MLOps / D\u00e9ploiement",
    "10": "Machine Learning",
    "11": "NLP / Traitement du langage",
    "12": "No-code / Low-code",
    "13": "Prompt Engineering",
    "14": "Python",
    "15": "Reinforcement Learning",
    "16": "SQL / Data Engineering",
    "17": "S\u00e9ries temporelles",
    "18": "Visualisation",
    "19": "\u00c9thique IA & RGPD"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "Automatisation": 0,
    "Big Data": 1,
    "Computer Vision": 2,
    "Data Engineering": 3,
    "Data Science": 4,
    "Deep Learning": 5,
    "Gestion de projet IA": 6,
    "IA G\u00e9n\u00e9rative": 7,
    "LangChain / Agents RAG": 8,
    "MLOps / D\u00e9ploiement": 9,
    "Machine Learning": 10,
    "NLP / Traitement du langage": 11,
    "No-code / Low-code": 12,
    "Prompt Engineering": 13,
    "Python": 14,
    "Reinforcement Learning": 15,
    "SQL / Data Engineering": 16,
    "S\u00e9ries temporelles": 17,
    "Visualisation": 18,
    "\u00c9thique IA & RGPD": 19
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "camembert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "problem_type": "multi_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.12.1",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 32005
}
